<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"d579c89d04bd59c98570be287432c17184e94316d8652b34c6d9194cc71f1260","backend":"d711ecf86c6852ee34ad538cd70e2e82d7031b366a0a095f4551f587c4d4d99f","plan_job_ref":"Job Test actions using target, replace, and exclude #16 at https://github.com/dflook/terraform-github-actions/actions/runs/16695281529","plan_out_hash":"af54f6551f41f4b8fe970c0e0f23f11b36540febd66e9f2091ddb38cf9a95d9a","plan_hash":"6d0bfe630bb091312531cc0de31b7521125fe26277e92ffb108c318e5a3284d6","plan_text_format":"diff","version":"99.0.0"} -->
OpenTofu plan in __tests/workflows/test-target-replace-exclude__
Excluding resources: `random_string.exclude_me`
With variables: `length = 8`
<details>
<summary>Plan: 4 to add, 0 to change, 3 to destroy. Changes to Outputs.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # random_string.also_exclude will be created
+   resource "random_string" "also_exclude" {
+       id          = (known after apply)
+       length      = 8
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

  # random_string.count[0] must be replaced
-/+ resource "random_string" "count" {
!~      id          = "*****" -> (known after apply)
!~      length      = 5 -> 8 # forces replacement
!~      result      = "*****" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] must be replaced
-/+ resource "random_string" "foreach" {
!~      id          = "*****" -> (known after apply)
!~      length      = 5 -> 8 # forces replacement
!~      result      = "*****" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # random_string.keep_me must be replaced
-/+ resource "random_string" "keep_me" {
!~      id          = "*****" -> (known after apply)
!~      length      = 5 -> 8 # forces replacement
!~      result      = "*****" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 3 to destroy.

Changes to Outputs:
+   also_exclude = (known after apply)
!~  count        = "VYVOC" -> (known after apply)
!~  foreach      = "7xhBS" -> (known after apply)
!~  keep_me      = "QtfkH" -> (known after apply)

Warning: Resource targeting is in effect

You are creating a plan with either the -target option or the -exclude
option, which means that the result of this plan may not represent all of the
changes requested by the current configuration.

The -target and -exclude options are not for routine use, and are provided
only for exceptional situations such as recovering from errors or mistakes,
or when OpenTofu specifically suggests to use it as part of an error message.
```
</details>

:memo: Plan generated in [Test actions using target, replace, and exclude #16](https://github.com/dflook/terraform-github-actions/actions/runs/16695281529)